Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff
Analysis change management part difference item.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.AnalysisModelName
The name of the analysis model.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.PartId
Part identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.TimeId
Time identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.ComparisonTimeId
Comparison time identifier.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.Index
Item Index.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.IsLastIndex
Is last index (returned).

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.Type
Difference type.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.PosIndex
Position index.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.PositionDelta
Physical/analysis position difference.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.PhysicalPosition
Physical position.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.AnalysisPosition
Analysis position.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.PhysicalRotation
Physical rotation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.AnalysisRotation
Analysis rotation.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.PhysicalProfile
Physical profile.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.AnalysisProfile
Analysis profile.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.PhysicalMaterial
Physical material.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.AnalysisMaterial
Analysis material.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.GetPositionDelta
Get position delta.
Returns: The position delta.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.GetPhysicalPosition
Get physical position.
Returns: The physical position.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.GetAnalysisPosition
Get analysis position.
Returns: The analysis position.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.GetPartPositionXyzDiff(Tekla.Structures.Identifier)
Get PartPositionXYZDiff.
partId: The part identifier.
Returns: The PartPositionXYZDiff.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.GetPartRotationDiff(Tekla.Structures.Identifier)
Get PartRotationDiff.
partId: The part identifier.
Returns: The PartRotationDiff.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.GetPartProfileDiff(Tekla.Structures.Identifier)
Get PartProfileDiff.
partId: The part identifier.
Returns: The PartProfileDiff.

Tekla.Structures.AnalysisInternal.DotAnalysisChangeManagementPartDiff.GetPartMaterialDiff(Tekla.Structures.Identifier)
Get PartMaterialDiff.
partId: The part identifier.
Returns: The PartMaterialDiff.